# TagOnPlacementUi Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TagOnPlacementUi Property
ParameterTypeId Class See Also
---
"Tag on Placement"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TagOnPlacementUi { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TagOnPlacementUi As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TagOnPlacementUi {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace